In [45]:
import pandas as pd
sales = pd.read_excel('Human resource.xlsx')
sales

            Employee Name         Department  Salary  Age  Gender Date of Join
0      Wilson  K Adinolfi  Production          62506   49   Male    07-05-2011
1    Karthikeyan Ait Sidi              IT/IS  104437   55   Male    30-03-2015
2        Sarah Akinkuolie  Production          64955   49  Female   07-05-2011
3            Trina Alagbe  Production          64991   49  Female   01-07-2008
4          Carol Anderson  Production          50825   31  Female   07-11-2011
..                    ...                ...     ...  ...     ...          ...
306         Jason Woodson  Production          65893   39   Male    07-07-2014
307      Catherine Ybarra  Production          48513   35  Female   09-02-2008
308       Jennifer Zamora              IT/IS  220450   42  Female   04-10-2010
309            Julia Zhou              IT/IS   89292   42  Female   30-03-2015
310          Colleen Zima  Production          45046   58  Female   29-09-2014

[311 rows x 6 columns]

### Find the Total Salary

In [46]:
b=sales['Salary'].sum()
b

21465433

### Find the average salary given in the company

In [47]:
b=sales['Salary'].mean()
b

69020.6848874598

### Find the Maximum salary

In [48]:
b=sales['Salary'].max()
b

250000

### Find the minimum Salary

In [49]:
b=sales['Salary'].min()
b

45046

###  Find the range of salary

In [50]:
b=250000-45046
b

204954

### Find the descriptive Statistics for the variable Salary and identify the Varience

### Find the average age of employees

In [51]:
b=sales['Age'].mean()
b

42.02893890675241

### Find the minimum age of employees 9. Find the maximum age of employees

In [52]:
b=sales['Age'].min()
b

24

### Find the descriptive Statistics for the variable Age and identify the Quartiles

### Find the count of Gender

In [53]:
b=sales['Gender'].count()
b

311

### Find the Frequency of gender in a Bar Chart. modify the chart

In [54]:
b=sales.['Gender'].plot(kind='bar')

SyntaxError: invalid syntax (1637846339.py, line 1)

### obtain the percentage value of number of male and female employees

### obtain the percentage value of number of male and female employees in a pie chart. modify the chart